TELEGRAM_BOT_TOKEN = '2119991543:AAH6KyBW4WtGOVkI2aHc2nda1J92mBanSWM'

quiz = {
     "Q1" :{
     "question":"Ви плануєте організувати публічний кінопоказ не дуже відомого, але важливого, на вашу думку, фільму. Однак постає питання авторських прав. Ви сумніваєтеся як краще вчинити.",
     
     "a1":"Зв’яжуся з дистриб’юторами фільму і висловлю бажання провести показ кіностічки. Поясню, що перегляд буде безкоштовним і домовлятимуся про вигідні умови показу фільму з правовласником. Усе ж заради мистецтва!",
     "a2": "Просто покажу фільм, не турбуючись про ліцензію. Що зі мною може зробити правовласник за невеликий кінопоказ для кількох десятків людей? Мене ж за кіновечір у в'язницю не посадять!",
     "a3": "Відмовлюся від ідеї показувати фільм. Уся ця морока  з ліцензіями, правовласниками і прокатом того не варта.", 
     "exp1": "Кінопоказ проходить успішно, після перегляду вдалося активно обговорити фільм з глядачами, а що вас найбільше потішило - це ваша доброчесність і відсутність докорів совісті.",
     "exp1-impact-points": 1,
     "exp1-pleasure-points": 1,
     "exp1-reputation-points": 1,

     "exp2": "Кінопоказ проходить успішно, однак вас це не тішить, адже через деякий час легальні дистриб’ютори фільму зв’язуються з вами. Може ви не знали, але просто показавши фільм, ви порушили майнові авторські права на публічний показ. Тому легальний прокатник тепер вимагає від вас штраф у вигляді 3 розмірів від ціни ліцензії прокату. І це вам ще дуже пощастило, могло ж бути і гірше.",    
     "exp2-impact-points": 1,
     "exp2-pleasure-points": -1,
     "exp2-reputation-points": -1,
     
    "exp3":"Найкраще просто посидіти вдома і не морочити собі голови, правда ж? Але який тоді з вас активіст і культурний менеджер?",
    "exp3-impact-points": 0,
    "exp3-pleasure-points": 0,
    "exp3-reputation-points": 0},
    

    "Q2" :{
     "question":"Ви дізналися, що музична група, яка вам дуже подобається, робить невеликий тур по Україні. Вам якось вдалося домовитися про концерт і у вашому місті. Які ваші наступні дії?",
     
     "a1":"Зроблю закритий івент, щоб підкреслити елітарність майбутнього концерту.",
     "a2": "Зроблю інформаційну кампанію в соцмережах, вкладу кошти в таргетовану рекламу.",
     "a3": "Підготую афіші та розвішу їх по місту, аби привернути увагу усіх.", 
     "exp1": "На жаль, про концерт майже ніхто не дізнався, прийшли лише ваші друзі. Подія не вдалась, ви втратили гроші, які вклали у оренду концерної зали, а також жоден артист не бажає більше мати з вами справи.",
     "exp1-impact-points": 1,
     "exp1-pleasure-points": 0,
     "exp1-reputation-points": -1,

     "exp2": "Схоже, що ваші смаки в музиці занадто вишукані, адже група та напрям музики важко сприймається громадою вашого міста.Тому на концерт прийшло не так вже й багато людей. Однак подія вийшла камерною та атмосферною, хоча квитки і не окупили гонорар артистів та оренду зали.",    
     "exp2-impact-points": 1,
     "exp2-pleasure-points": 1,
     "exp2-reputation-points": 1,
     
    "exp3":"Схоже, що ви обрали не той метод комунікації або ж просто цей метод не подіяв на вашу цільову аудиторію, тож концерт був малолюдним. Квитки не окупили гонорар артистів та оренду зали. Ви втратили і власні кошти, і якусь частину репутації.",
    "exp3-impact-points": 1,
    "exp3-pleasure-points": -1,
    "exp3-reputation-points": -1},
     

     "Q3" :{
     "question":"Ви організовуєте виставку картин відомого сучасного художника. Однак так вийшло, що одну з картин вкрали. Що робитимете?",
     
     "a1":"Викличу поліцію та юристів, нехай відразу розбираються.",
     "a2": "Спробую власноруч все з'ясувати, не привертаючи багато уваги.",
     "a3": "Заявлю, що умиваєте руки. Все ж картина - це власність художника, нехай він і бідкається.", 
     "exp1": "Ви витратили купу свого часу на тяганину зі слідством, однак це не дало ніякого результату. Але ви хоча б старалися та сприяли слідству, до вас питань немає.",
     "exp1-impact-points": 0,
     "exp1-pleasure-points": -1,
     "exp1-reputation-points":1,

     "exp2": "Вам нічого не вдається, художник розлючений, а креативна спільнота ображена вашим безвідповідальним ставленням до мистецтва.",    
     "exp2-impact-points": -1,
     "exp2-pleasure-points": -1,
     "exp2-reputation-points": -1,
     
    "exp3":"Митець обурений вашою цинічністю та безвідповідальністю. На вас ображена вся мистецька спільнота, а ваш провал згадуватимуть ще дуже довго.",
    "exp3-impact-points": -1,
    "exp3-pleasure-points": -1,
    "exp3-reputation-points": -1},

    "Q11": {
        "question": "11",

        "a1": "Викличу.",
        "a2": "Спробую.",
        "a3": "Заявлю.",
        "exp1": "Але ви хоча б старалися та сприяли слідству, до вас питань немає.",
        "exp1-impact-points": 0,
        "exp1-pleasure-points": -1,
        "exp1-reputation-points": 1,

        "exp2": "спільнота ображена вашим безвідповідальним ставленням до мистецтва.",
        "exp2-impact-points": -1,
        "exp2-pleasure-points": -1,
        "exp2-reputation-points": -1,

        "exp3": " спільнота, а ваш провал згадуватимуть ще дуже довго.",
        "exp3-impact-points": -1,
        "exp3-pleasure-points": -1,
        "exp3-reputation-points": -1},
}


evaluation = {
     "good":"<b>Ви персона для наслідування у культурному менеджменті.</b>\nПомітно, що ви на культурному менеджменті собаку з'їли. Попри всю непередбачуваність роботи, вам вдалося не вигоріти, принести колосальну користь громаді та водночас не впасти в бруд обличчям. Вас ставлять в приклад, беруть численні інтерв’ю та запрошують на конференції ділитися досвідом. Оце ви красава, поважаємо!",
     "middle":"<b>Ви початківець у культурному менеджменті.</b>\nПомітно, що ви орієнтуєтесь у потребах цільової аудиторії, знаєте, як просувати культуру в маси, але все ж не маєте достатньо досвіду, аби це завжди виходило вдало. Пробуйте мислити нестандартно, втілюйте ідеї, випробовуйте різні методи, аналізуйте власні та чужі помилки і не переставайте вчитися - тоді усе вийде!",
     "bad":"<b>Ви не культурний менеджер.</b>\nСхоже, що ви вирішили пройти цей тест заради цікавості, адже в культурному менеджменті ви майже не розбираєтесь. Не впадайте у відчай, адже робота культурного менеджера — це все ж таки робота (і робота не для всіх), тому не переставайте працювати. Адже, так би мовити, культурними менеджерами не народжуються, культурними менеджерами стають!"
}





